Autodesk.Revit.DB.CombinableElementArray
An array that contains CombinableElement objects.

Autodesk.Revit.DB.CombinableElementArray.Insert(Autodesk.Revit.DB.CombinableElement,System.Int32)
System.Int32
Insert the specified element into the array.
item: The CombinableElement to be inserted into the array.
index: The CombinableElement will be inserted before this index.
Returns: Returns whether the CombinableElement was inserted into the array.

Autodesk.Revit.DB.CombinableElementArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.CombinableElementArray.ReverseIterator
Autodesk.Revit.DB.CombinableElementArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.CombinableElementArray.ForwardIterator
Autodesk.Revit.DB.CombinableElementArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.CombinableElementArray.Append(Autodesk.Revit.DB.CombinableElement)
void
Add the element to the end of the array.
item: The CombinableElement to be added.

Autodesk.Revit.DB.CombinableElementArray.Clear
void
Removes every CombinableElement from the array, rendering it empty.

Autodesk.Revit.DB.CombinableElementArray.Size
System.Int32
get
Returns the number of CombinableElements that are in the array.

Autodesk.Revit.DB.CombinableElementArray.Item(System.Int32)
Autodesk.Revit.DB.CombinableElement
Gets or sets a CombinableElement at a specified index within the array.
index: The index of the CombinableElement to be set or retrieved.
Returns: Returns the CombinableElement at the specified index.

Autodesk.Revit.DB.CombinableElementArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.